openfoam2206/tutorials/combustion/fireFoam/LES/compartmentFire/0.orig/panelRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 294.75;

boundaryField
{

    wallPanel_top
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 294.75;
        h               uniform 10;
        kappaMethod     solidThermo;
        value           uniform 294.75;
    }

    wallPanel_side
    {
        type empty;
    }

    internalWallPanel_side
    {
        type empty;
    }

    "region0_to_.*"
    {
        type                compressible::turbulentTemperatureRadCoupledMixed;
        neighbourField      T;
        kappaMethod         solidThermo;
        qrNbr               qr;
        qr                  none;
        value               $internalField;
    }
}


// ************************************************************************* //
